{
  "template": "templates/wiki/sidebar.hbs",
  "options": {
    "theme-color": {
      "type":"color",
      "label":"Theme color",
      "value": "#fa9431"
    },
    "quote": {
      "type":"text",
      "label":"Quote",
      "value": "Oh... A customer?"
    },
    "image": {
      "type":"text",
      "label":"Reference image",
      "value": "https://static.f-list.net/images/charinline/ed/13/ed132e0a4466632c4aff46947bab4ebd32ced5ad.png"
    },

    "attributes":{
      "type":"list",
      "label":"Wiki attributes",
      "template":{
        "label":{
          "type":"text",
          "label":"Property name"
        },
        "value":{
          "type":"text",
          "label":"Value"
        }
      },
      "items":[
        {
          "label":"Name",
          "value": "Loaf"
        },
        {
          "label":"Race",
          "value": "Fire elemental"
        },
        {
          "label":"Species",
          "value": "Goo girl"
        },
        {
          "label":"Class",
          "value": "Cook"
        }
      ]
    },

    "content":{
      "type":"textarea",
      "label":"Left area content",
      "value": "Write a short summary over here about your character; do it in very general terms. Describe perhaps the most importants bits and bobs about them - species, job positions, direct familial relationships. You've read Wikipedia articles; I think you know how they're structured, more or less.\n\n## Appearance\n\nThough the inline image on the right should satisfy most, I doubt it is capable of describing everything about your character.\n\nBe as descriptive as possible; you know you want to show off your adjective vocabulary to whoever visits your page.\n\n## History\n\nHere you can delve in a bit deeper on your character's (public) history. Don't go into excruciating detail here though; a paragraph of 100 words should be more than enough for a single event in their life.\n\nAdditionally, I doubt anyone will care if you have more than 5 formative events described, because everything else, possibly written in more detailed prose can be displayed within..."
    },
    "sources":{
      "type":"list",
      "label":"Source dropdowns",
      "template":{
        "title":{
          "type":"text",
          "label":"Title"
        },
        "content":{
          "type":"textarea",
          "label":"The source text"
        }
      },
      "items":[
        {
          "title":"Bestiary entry",
          "content":"Here you can expand on your character's race's or species specificities and whatnot. *Really* go into those details on how their eyes glow, what makes their wings allow them to fly, or how their cum is able to impregnate any living being, no matter if they are fertile or not."
        },
        {
          "title":"Diary",
          "content":"Or perhaps you'd like to write out a diary with numerous entries instead? Well, that is going to need a bit more knowledge in HTML (mainly to add more nested dropdowns), but I'm certain you'll be able to do it!"
        }
      ]
    }
  }
}
